; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	thermograph0 - mode
	image2 - mode
	spectrograph1 - mode
	Star4 - direction
	Star9 - direction
	GroundStation11 - direction
	Star1 - direction
	Star0 - direction
	GroundStation6 - direction
	GroundStation5 - direction
	Star2 - direction
	Star10 - direction
	GroundStation7 - direction
	GroundStation12 - direction
	GroundStation8 - direction
	Star13 - direction
	Star3 - direction
	Star14 - direction
	Star15 - direction
	Planet16 - direction
	Star17 - direction
	Phenomenon18 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 spectrograph1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 GroundStation11)
	(supports instrument1 spectrograph1)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation12)
	(calibration_target instrument1 GroundStation6)
	(supports instrument2 spectrograph1)
	(supports instrument2 image2)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star2)
	(supports instrument4 spectrograph1)
	(supports instrument4 image2)
	(calibration_target instrument4 Star10)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 GroundStation8)
	(calibration_target instrument5 GroundStation12)
	(calibration_target instrument5 GroundStation7)
	(calibration_target instrument5 Star3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation7)
	(supports instrument6 image2)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 Star3)
	(calibration_target instrument6 Star13)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation12)
)
(:goal (and
	(pointing satellite0 Star4)
	(pointing satellite1 Star15)
	(have_image Star14 thermograph0)
	(have_image Star15 thermograph0)
	(have_image Planet16 image2)
	(have_image Star17 spectrograph1)
	(have_image Phenomenon18 image2)
))

)

; plan
1. (turn_to satellite0 groundstation11 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 groundstation11)
   goals met: 0 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
3. (calibrate satellite0 instrument0 groundstation11)
   added: (calibrated instrument0)
   goals met: 0 of 7
4. (turn_to satellite0 star14 groundstation11)
   deleted: (pointing satellite0 groundstation11)
   added: (pointing satellite0 star14)
   goals met: 0 of 7
5. (take_image satellite0 star14 instrument0 thermograph0)
   added: (have_image star14 thermograph0)
   goals met: 1 of 7
6. (turn_to satellite0 planet16 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 planet16)
   goals met: 1 of 7
7. (take_image satellite0 planet16 instrument0 image2)
   added: (have_image planet16 image2)
   goals met: 2 of 7
8. (turn_to satellite0 phenomenon18 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 phenomenon18)
   goals met: 2 of 7
9. (take_image satellite0 phenomenon18 instrument0 image2)
   added: (have_image phenomenon18 image2)
   goals met: 3 of 7
10. (turn_to satellite0 star15 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 star15)
   goals met: 3 of 7
11. (take_image satellite0 star15 instrument0 thermograph0)
   added: (have_image star15 thermograph0)
   goals met: 4 of 7
12. (turn_to satellite0 star17 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star17)
   goals met: 4 of 7
13. (take_image satellite0 star17 instrument0 spectrograph1)
   added: (have_image star17 spectrograph1)
   goals met: 5 of 7
14. (turn_to satellite0 star4 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 star4)
   goals met: 6 of 7
15. (turn_to satellite1 star15 groundstation7)
   deleted: (pointing satellite1 groundstation7)
   added: (pointing satellite1 star15)
   goals met: 7 of 7
